[
  {
    "name": "Ingvild Indrebø",
    "uri": "https:\/\/twitter.com\/IngvildIndrebo",
    "title": "Can you hear me now? Saying goodbye to clumsy video calls thanks to code.",
    "description": "Almost every video call begins with the same clumsy questions. Can you hear me now? Did I just turn off my camera instead of my mic now? But what if we could take the awkward troubleshooting out of the conversation, and solve it with code instead?\n\nIn this talk, Ingvild Indrebø will give you a glimpse into aspects of WebRTC, WebAudio and Canvas, by showing you how she used these technologies to build a user-friendly and accessible tool to make sure you’re all set for your video call.\nOutline\nThe opening will be an introduction to the familiar situation of non-working video calls.\nThe talk itself will have three main parts, with a very brief intro to the tech we used, but focusing on how we used each technology in the final user flow, and what we learned on the way.\n\nThe first part is focused on WebRTC which is used to access video and audio from the user.\nThe second part is focused on WebAudio, and how we use that to make sure the user’s microphone is working.\nThe third is focused on Canvas, which we use to visualize audio input and output."
  },
  {
    "name": "Ben Schwarz",
    "uri": "https:\/\/twitter.com\/benschwarz",
    "title": "The Critical Request: An investigation into what blocks render",
    "description": "Serving a website seems pretty simple: send some HTML, the browser figures out what resources to load next. Then we wait patiently for the page to be ready.\n\nHowever, browsers are complex and without a firm grasp on how resources are prioritized, fetched and rendered we’re needlessly penalising our customers with serious performance repercussions. \n\nIn this talk we’ll study how browsers determine which requests should be made, in what order, and what prevents the browser from rendering content as quickly as about:blank."
  },
  {
    "name": "Eli Schütze Ramírez",
    "uri": "https:\/\/twitter.com\/elibelly",
    "title": "Internationalisation is a Piece of Cake",
    "description": "While about 51% of the world’s websites are in English, only about 25% of web users are English speakers. With half of the world’s population online, internationalisation is as relevant as ever! Let’s explore how i18n gets made on the web and what we should keep in mind when making the web more accessible to the world."
  },
  {
    "name": "Tierney Cyren",
    "uri": "https:\/\/twitter.com\/bitandbang",
    "title": "Building Foundations of the Node.js Community",
    "description": "Node.js is an amazing project in terms of code - it’s evolved rapidly to cover an immense landscape, from web apps, desktop apps, APIs, IoT, robotics, and beyond. There’s something else that Node has also been absolutely killer with, though: the community.\n\nOne really awesome thing is that the Node.js community has an established community for building the Node community. How meta is that? The Node.js project is sectioned off into different Working Groups (WGs) that are tasked with different objectives - the one that was tasked with building the community was the Evangelism WG.\n\nThat said, there’s a transition happening. The Evangelism WG planted the seed Node.js Community efforts. Now, the Community Committee has taken this a step further and is mobilizing to start exploding the awareness and understanding of Node and its diverse ecosystem.\n\nAttendees will gain an understanding of what the Node.js Community Committee is, what it's goals are, and how they can start getting involved."
  }
]
